app/controllers/exercise_nodes_controller.rb

INSERT INTO "exercise_nodes" ("title", "series", "weigth", "exercise_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "Test1"], ["series", "3x10"], ["weigth", "10"], ["exercise_id", 516], ["created_at", "2021-06-26 17:45:20.950842"], ["updated_at", "2021-06-26 17:45:20.950842"]]
---
  def add_node
    # # Find Exercise by id
    # exercise = Exercise.find(params[:id])
    #
    # # Create new node
    # node = {
    #     "title" => params[:title],
    #     "weight" => params[:weight],
    #     "series" => params[:series]
    # }
    #
    # # Append new node to json and save object
    # exercise.exercises.push(node)
    # exercise.save

    ExerciseNode.create(title: params[:title], weight: params[:weight], series: params[:series], exercise_id: params[:id])

DELETE FROM "exercise_nodes" WHERE "exercise_nodes"."id" = $1  [["id", 2]]
---
  def delete_node
    # Find Exercise by id
    # exercise = Exercise.find(params[:id])
    # new_json = []
    #
    # # Convet String into JSON
    # json = ActiveSupport::JSON.decode exercise.exercises.to_s.gsub('=>', ':')
    #
    # # Add every node to new json, except one, which is equals to deleted
    # json.each do |node|
    #   unless node['title'].eql? params[:title] and node['weight'].eql? params[:weight] and node['series'].eql? params[:series]
    #     new_json.push(node)
    #   end
    # end
    #
    # # Replace old json with new json, and save object
    # exercise.exercises = new_json
    # exercise.save
    ExerciseNode.destroy(params[:exercise_node_id])