app/controllers/exercise_nodes_controller.rb

SELECT "exercises".* FROM "exercises" WHERE "exercises"."id" = $1 LIMIT $2  [["id", 18], ["LIMIT", 1]]
UPDATE "exercises" SET "exercises" = $1, "updated_at" = $2 WHERE "exercises"."id" = $3  [["exercises", "[{\"title\":\"Jarok\",\"weight\":\"\",\"series\":\"25\"}]"], ["updated_at", "2020-07-26 11:19:59.697218"], ["id", 18]]
---
  def add_node
    exercise = Exercise.find(params[:id])

    node = {
        "title" => params[:title],
        "weight" => params[:weight],
        "series" => params[:series]
    }

    exercise.exercises.push(node)
    exercise.save