app/controllers/exercises_controller.rb

SELECT "exercises".* FROM "exercises" WHERE "exercises"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  def show
    @exercise = Exercise.find(params[:id])

SELECT "exercises".* FROM "exercises" WHERE "exercises"."user_id" = $1 GROUP BY date(exercise.created_at) ORDER BY "exercises"."created_at" DESC LIMIT $2 OFFSET $3  [["user_id", 1], ["LIMIT", 20], ["OFFSET", 0]]
SELECT COUNT(*) FROM "exercises" WHERE "exercises"."user_id" = $1  [["user_id", 0]]
SELECT COUNT(*) FROM "exercises"
SELECT "exercises".* FROM "exercises" WHERE "exercises"."user_id" = $1 ORDER BY "exercises"."created_at" DESC LIMIT $2 OFFSET $3  [["user_id", 1], ["LIMIT", 20], ["OFFSET", 0]]
INSERT INTO "exercises" ("title", "time", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Beh"], ["time", "12"], ["created_at", "2020-07-11 00:00:00"], ["updated_at", "2020-07-25 16:47:51.499643"]]
SELECT "exercises".* FROM "exercises" WHERE "exercises"."user_id" = $1 ORDER BY "exercises"."created_at" DESC LIMIT $2 OFFSET $3  [["user_id", 1], ["LIMIT", 5], ["OFFSET", 0]]
---
  def index
    @exercises_day = []

    if signed_in?
      @exercises = Exercise.where(user_id: current_user['id']).order(created_at: :desc).paginate(page: params[:page])
      exercises = []
      (1..@exercises.length).each do |i|
        exercises.push(@exercises[i - 1])
        date = @exercises[i - 1].created_at.strftime('%d.%m.%Y')
        if (@exercises[i].equal? nil) || (!date.eql? @exercises[i].created_at.strftime('%d.%m.%Y'))
          @exercises_day.push(exercises)
          exercises = []
        end
      end
    else
      @exercises = Exercise.where(user_id: 0).order(created_at: :desc).paginate(page: params[:page])

INSERT INTO "exercises" ("title", "time", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Cvicenie"], ["time", ""], ["created_at", "2020-08-04 16:59:33.406331"], ["updated_at", "2020-08-04 16:59:33.406331"], ["user_id", 1]]
---
  def create
    Exercise.create(exercise_params)

DELETE FROM "exercises" WHERE "exercises"."id" = $1  [["id", 14]]
---
  def destroy
    Exercise.destroy(params[:id])

UPDATE "exercises" SET "time" = $1, "created_at" = $2, "updated_at" = $3 WHERE "exercises"."id" = $4  [["time", "11"], ["created_at", "2021-06-27 00:00:00"], ["updated_at", "2021-06-29 14:59:07.227586"], ["id", 517]]
---
  def update
    exercise_parameters = exercise_params
    if exercise_parameters[:created_at].eql? ""
      exercise_parameters.delete :created_at
      #exercise_parameters[:created_at] = Exercise.find(params[:id]).created_at
    end
    Exercise.update(id = params[:id], exercise_parameters)