app/controllers/exercises_controller.rb

SELECT "exercises".* FROM "exercises" ORDER BY "exercises"."created_at" DESC
---
  def index
    @exercises_day = []

    if signed_in?
      @exercises = Exercise.where(user_id: current_user['id']).order(created_at: :desc).paginate(page: params[:page])
      exercises = []
      (1..@exercises.length).each do |i|