app/controllers/exercises_controller.rb

  def index
    @exercises_day = []
    user = session[:user]
    if user == nil
      db_exercise = [] #Exercise.order(created_at: :desc).all
    else
      db_exercise = Exercise.where(user_id: user['id']).order(created_at: :desc).all
    end

    exercises = []
    (1..db_exercise.length).each do |i|
---
SELECT "exercises".* FROM "exercises" WHERE "exercises"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]