app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["email", "mat.horniak@gmail.com"], ["LIMIT", 1]]
---
  def login
    user = User.where(email: params[:user][:email]).first

SELECT "users".* FROM "users" WHERE "users"."email" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["email", "jozef"], ["LIMIT", 1]]
---
  def register
    User.create(email: params[:user][:email])
    user = User.where(email: params[:user][:email]).first