app/controllers/users_controller.rb

INSERT INTO "users" ("nick", "created_at", "updated_at", "name", "password_digest") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["nick", "matho"], ["created_at", "2021-06-27 12:24:33.673684"], ["updated_at", "2021-06-27 12:24:33.673684"], ["name", "Matej Horniak"], ["password_digest", "asdas"]]
---
  def create
    User.create(user_params)

SELECT "users".* FROM "users" WHERE "users"."nick" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["nick", "mathorniak"], ["LIMIT", 1]]
---
  def login_user(nick)
    user = User.where(nick: nick).first