app/models/user.rb

  def generate_authentication_token!
    puts "create authentication token"
    self.authentication_token = Digest::SHA1.hexdigest("#{Time.now}-#{self.id}-#{self.updated_at}")
    puts self.authentication_token
    self.save
---
UPDATE "users" SET "updated_at" = $1, "authentication_token" = $2 WHERE "users"."id" = $3  [["updated_at", "2020-08-14 12:30:33.076533"], ["authentication_token", "b6f7dec80eca48993e61f74be539e21cffb92f4f"], ["id", 3]]