app/views/exercises/show.html.erb

SELECT "exercise_nodes".* FROM "exercise_nodes" WHERE "exercise_nodes"."exercise_id" = $1  [["exercise_id", 516]]
---
        <tbody>
        <% @exercise.exercise_nodes.each do |exercise| %>